betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417_i3c.h
/********************************** (C) COPYRIGHT  *******************************
* File Name          : ch32h417_i3c.h
* Author             : WCH
* Version            : V1.0.0
* Date               : 2025/03/01
* Description        : This file contains all the functions prototypes for the
*                      RNG firmware library.
*********************************************************************************
* Copyright (c) 2025 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#ifndef __CH32H417_I3C_H
#define __CH32H417_I3C_H

#ifdef __cplusplus
 extern "C" {
#endif
#include "ch32h417.h"

/* I3C controller bus Init structure definition */
typedef struct
{
  uint32_t SDAHoldTime;         /* Specifies the I3C SDA hold time.
                                     This parameter must be a value of @ref SDAHoldTime */

  uint32_t WaitTime;            /* Specifies the time that the main and the new controllers should wait before
                                     issuing a start.
                                     This parameter must be a value of @ref WaitTime */

  uint8_t BusFreeDuration;      /* Specifies the I3C controller duration in number of kernel clock cycles, after
                                     a stop and before a start.
                                     This parameter must be a number  from 0 to 0xFF. */

  uint8_t BusIdleDuration;      /* Specifies the I3C controller duration in number of kernel clock cycles to be
                                     elapsed, after that both SDA and SCL are continuously high and stable
                                     before issuing a hot-join event.
                                     This parameter must be a number  from 0 to 0xFF. */

  uint8_t SCLPPLowDuration;     /* Specifies the I3C SCL low duration in number of kernel clock cycles
                                     in I3C push-pull phases.
                                     This parameter must be a number from 0 to 0xFF. */

  uint8_t SCLI3CHighDuration;   /* Specifies the I3C SCL high duration in number of kernel clock cycles,
                                     used for I3C messages for I3C open-drain and push pull phases.
                                     This parameter must be a number from 0 to 0xFF. */

  uint8_t SCLODLowDuration;     /* Specifies the I3C SCL low duration in number of kernel clock cycles in
                                     open-drain phases, used for legacy I2C commands and for I3C open-drain phases.
                                     This parameter must be a number  from 0 to 0xFF. */

  uint8_t SCLI2CHighDuration;   /* Specifies the I3C SCL high duration in number of kernel clock cycles, used
                                     for legacy I2C commands.
                                     This parameter must be a number  from 0 to 0xFF. */
} I3C_Ctrl_BusTypeDef;

/* I3C controller configration Init structure definition */
typedef struct
{
  uint8_t DynamicAddr;            /* Specifies the dynamic address of the controller when goes in target mode.
                                       This parameter must be a number  from 0 to 0x7F. */

  uint8_t StallTime;              /*  Specifies the controller clock stall time in number of kernel clock cycles.
                                       This parameter must be a number  from 0 to 0xFF. */

  FunctionalState HotJoinAllowed_EN; /*  Specifies the Enable/Disable state of the controller Hot Join acknowledgement
                                       when receiving a hot join request from target.
                                       This parameter can be set to ENABLE or DISABLE */

  FunctionalState ACKStallState;  /*  Specifies the Enable/Disable state of the controller clock stall
                                       on the ACK phase.
                                       This parameter can be set to ENABLE or DISABLE */

  FunctionalState CCCStallState;  /*  Specifies the Enable/Disable state of the controller clock stall on the
                                       T bit phase of a CCC communication to allow the target to decode command.
                                       This parameter can be set to ENABLE or DISABLE */

  FunctionalState TxStallState;   /*  Specifies the Enable/Disable state of the controller clock stall on
                                       parity phase of data to allow the target to read received data.
                                       This parameter can be set to ENABLE or DISABLE */

  FunctionalState RxStallState;   /*  Specifies the Enable/Disable state of the controller clock stall on the T bit
                                       phase of data enable to allow the target to prepare data to be sent.
                                       This parameter can be set to ENABLE or DISABLE */
} I3C_CtrlConfTypeDef;

/* I3C target configration Init structure definition */
typedef struct
{
  uint32_t MaxDataSpeed;               /*  Specifies the I3C target returned GETMXDS CCC format.
                                            This parameter must be a value of @ref MaxDataSpeed */

  uint32_t HandOffActivityState;       /*  Specifies the I3C target activity state when becoming controller.
                                            This parameter must be a value of @ref HandOffActivityState */

  uint32_t IBIPayloadSize;             /*  Specifies the I3C target payload data size.
                                            This parameter must be a value of @ref IBIPayloadSize  */

  uint32_t DataTurnAroundDuration;     /*  Specifies the I3C target clock-to-data turnaround time.
                                            This parameter must be a value of @ref DataTurnAroundDuration */
  
  uint16_t MaxReadDataSize;            /*  Specifies the numbers of data bytes that the target can read at maximum.
                                            This parameter must be a number from 0 to 0xFFFF. */

  uint16_t MaxWriteDataSize;           /*  Specifies the numbers of data bytes that the target can write at maximum.
                                            This parameter must be a number  from 0 to 0xFFFF. */

  uint8_t MaxReadTurnAround;           /*  Specifies the target maximum read turnaround byte.
                                            This parameter must be a number  from 0 to 0xFF. */

  uint8_t Identifier;                  /*  Specifies the target characteristic ID (MIPI named reference DCR).
                                            This parameter must be a number from 0 to 0xFF. */

  uint8_t MIPIIdentifier;              /*  Specifies the bits [12-15] of the 48-provisioned ID
                                            (MIPI named reference PID), other 48-provisioned ID are hardcoded.
                                            This parameter must be a number from 0 to 0xF. */

