betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417_i3c.h
  FunctionalState CtrlRoleRequest;     /*  Specifies the Enable/Disable state of the target authorization request
                                            for a second master Chip.
                                            This parameter can be set to ENABLE or DISABLE */

  FunctionalState HotJoinRequest;      /*  Specifies the Enable/Disable state of the target hot join
                                            authorization request.
                                            This parameter can be set to ENABLE or DISABLE */

  FunctionalState IBIRequest;          /*  Specifies the Enable/Disable state of the target in Band Interrupt
                                            authorization request.
                                            This parameter can be set to ENABLE or DISABLE */

  FunctionalState IBIPayload_EN;       /*  Specifies the Enable/Disable state of sending data payload after
                                            an accepted IBI.
                                            This parameter can be set to ENABLE or DISABLE */


  FunctionalState CtrlCapability;      /*  Specifies the Enable/Disable state of the target controller capability.
                                            This parameter can be set to ENABLE or DISABLE */

  FunctionalState GroupAddrCapability; /*  Specifies the Enable/Disable state of the target support of group address
                                            after a controller role hand-off.
                                            This parameter can be set to ENABLE or DISABLE */

  FunctionalState MaxSpeedLimitation;  /*  Specifies the Enable/Disable state of the target max data speed limitation.
                                            This parameter can be set to ENABLE or DISABLE */

  FunctionalState HandOffDelay;        /*  Specifies the Enable/Disable state of the target need of delay to process
                                            the controller role hand-off.
                                            This parameter can be set to ENABLE or DISABLE */

  FunctionalState PendingReadMDB;      /*  Specifies the Enable/Disable state of the transmission of a mandatory
                                            data bytes indicating a pending read notification for GETCAPR CCC command.
                                            This parameter can be set to ENABLE or DISABLE */
} I3C_TgtConfTypeDef;

/* I3C device configration Init structure definition */
typedef struct
{
  uint8_t DeviceIndex;               /*  Specifies the index value of the device in the DEVRx register.
                                          This parameter must be a a value of @ref DeviceIndex */

  uint8_t TargetDynamicAddr;         /*  Specifies the dynamic address of the target x (1 to 4) connected on the bus.
                                          This parameter must be a number from 0 to 0x7F.  */

  FunctionalState IBIAck;            /*  Specifies the Enable/Disable state of the controller's ACK when receiving
                                          an IBI from a target x (1 to 4) connected on the bus.
                                          This parameter can be set to ENABLE or DISABLE */

  FunctionalState IBIPayload;        /*  Specifies the Enable/Disable state of the controller's receiving IBI payload
                                          after acknowledging an IBI requested from a target x (1 to 4) connected
                                          on the bus.
                                          This parameter can be set to ENABLE or DISABLE */

  FunctionalState CtrlRoleReqAck;    /*  Specifies the Enable/Disable state of the controller's ACK when receiving
                                          a control request from a target x (1 to 4) connected on the bus.
                                          This parameter can be set to ENABLE or DISABLE */

  FunctionalState CtrlStopTransfer;  /*  Specifies the Enable/Disable state of the controller's stop transfer after
                                          receiving an IBI request from a target x (1 to 4) connected on the bus.
                                          This parameter can be set to ENABLE or DISABLE */

} I3C_DeviceConfTypeDef;

/* I3C CCC information Init structure definition */
typedef struct
{
  uint32_t DynamicAddrValid;    /*  I3C target Dynamic Address Valid (updated during ENTDAA/RSTDAA/SETNEWDA CCC)
                                     This parameter can be Valid=1 or Not Valid=0                                    */
  uint32_t DynamicAddress;      /*  I3C target Dynamic Address (updated during ENTDAA/RSTDAA/SETNEWDA CCC)           */
  uint32_t MaxWriteLength;      /*  I3C target Maximum Write Length (updated during SETMWL CCC)                      */
  uint32_t MaxReadLength;       /*  I3C target Maximum Read Length (updated during SETMRL CCC)                       */
  uint32_t ResetAction;         /*  I3C target Reset Action level (updated during RSTACT CCC)                        */
  uint32_t ActivityState;       /*  I3C target Activity State (updated during ENTASx CCC)                            */
  uint32_t HotJoinAllowed;      /*  I3C target Hot Join (updated during ENEC/DISEC CCC)
                                     This parameter can be Allowed=1 or Not Allowed=0                                */
  uint32_t InBandAllowed;       /*  I3C target In Band Interrupt (updated during ENEC/DISEC CCC)
                                     This parameter can be Allowed=1 or Not Allowed=0                                */
  uint32_t CtrlRoleAllowed;     /*  I3C target Controller Role Request (updated during ENEC/DISEC CCC)
                                     This parameter can be Allowed=1 or Not Allowed=0                                */
  uint32_t IBICRTgtAddr;        /*  I3C controller receive Target Address during IBI or Controller Role Request event*/
  uint32_t IBITgtNbPayload;     /*  I3C controller get Number of Data Payload after an IBI event                     */
  uint32_t IBITgtPayload;       /*  I3C controller receive IBI Payload after an IBI event                            */
} I3C_CCCInfoTypeDef;

/* I3C_Notification_ID enumeration */
typedef enum
{
  EVENT_ID_GETACCCR = (0x00000001),    /* I3C target complete controller-role hand-off (direct GETACCR CCC) event         */
  EVENT_ID_IBIEND = (0x00000002),      /* I3C target IBI end process event                                                */
  EVENT_ID_DAU = (0x00000004),         /* I3C target receive a dynamic address update (ENTDAA/RSTDAA/SETNEWDA CCC) event  */
  EVENT_ID_GETx = (0x00000008),        /* I3C target receive any direct GETxxx CCC event                                  */
  EVENT_ID_GETSTATUS = (0x00000010),   /* I3C target receive get status command (direct GETSTATUS CCC) event              */
  EVENT_ID_SETMWL = (0x00000020),      /* I3C target receive maximum write length update (direct SETMWL CCC) event        */
  EVENT_ID_SETMRL = (0x00000040),      /* I3C target receive maximum read length update(direct SETMRL CCC) event          */
  EVENT_ID_RSTACT = (0x00000080),      /* I3C target detect reset pattern (broadcast or direct RSTACT CCC) event          */
  EVENT_ID_ENTASx = (0x00000100),      /* I3C target receive activity state update (direct or broadcast ENTASx) event     */
  EVENT_ID_ENEC_DISEC = (0x00000200),  /* I3C target receive a direct or broadcast ENEC/DISEC CCC event                   */
  EVENT_ID_DEFTGTS = (0x00000400),     /* I3C target receive a broadcast DEFTGTS CCC event                                */
  EVENT_ID_DEFGRPA = (0x00000800),     /* I3C target receive a group addressing (broadcast DEFGRPA CCC) event             */
  EVENT_ID_WKP = (0x00001000),         /* I3C target wakeup event                                                         */
  EVENT_ID_IBI = (0x00002000),         /* I3C controller receive IBI event                                                */
  EVENT_ID_CR = (0x00004000),          /* I3C controller controller-role request event                                    */
  EVENT_ID_HJ = (0x00008000),          /* I3C controller hot-join event                                                    */
}I3C_Notify_ID_TypeDef;

/* I3C_FIFO_Configration structure definition */
typedef struct
{
  uint32_t RxFifoThreshold; /*  Specifies the I3C Rx FIFO threshold level.
                                 This parameter must be a value of @ref I3C_RX_FIFO_THRESHOLD */

  uint32_t TxFifoThreshold; /*  Specifies the I3C Tx FIFO threshold level.
                                 This parameter must be a value of @ref I3C_TX_FIFO_THRESHOLD */

