betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417_i3c.h
  uint32_t ControlFifo;     /*  Specifies the I3C control FIFO enable/disable state.
                                 This parameter is configured only with controller mode and it
                                 must be a value of @ref I3C_CONTROL_FIFO_STATE */

  uint32_t StatusFifo;      /*  Specifies the I3C status FIFO enable/disable state.
                                 This parameter is configured only with controller mode and it
                                 must be a value of @ref I3C_STATUS_FIFO_STATE */
} I3C_FifoConfTypeDef;


/* I3C_SDAHoldTime*/
#define I3C_SDAHoldTime_0_5                     ((uint32_t)0x00000000)
#define I3C_SDAHoldTime_1_5                     ((uint32_t)0x10000000)

/* I3C_WaitTime */
#define I3C_WaitTime_State_0                    ((uint32_t)0x00000000)
#define I3C_WaitTime_State_1                    ((uint32_t)0x00000100)
#define I3C_WaitTime_State_2                    ((uint32_t)0x00000200)
#define I3C_WaitTime_State_3                    ((uint32_t)0x00000300)

/* I3C_IBIPayloadSize */
#define I3C_IBIPayloadSize_None                 ((uint32_t)0x00000000)
#define I3C_IBIPayloadSize_1B                   ((uint32_t)0x00010000)
#define I3C_IBIPayloadSize_2B                   ((uint32_t)0x00020000)
#define I3C_IBIPayloadSize_3B                   ((uint32_t)0x00030000)
#define I3C_IBIPayloadSize_4B                   ((uint32_t)0x00040000)

/* I3C_DataTurnAroundDuration */
#define I3C_DataTurnAroundDuration_Mode0        ((uint32_t)0x00000000)
#define I3C_DataTurnAroundDuration_Mode1        ((uint32_t)0x01000000)

/* I3C_MaxDataSpeed */
#define I3C_MaxDataSpeed_Format_Mode0           ((uint32_t)0x00000000)
#define I3C_MaxDataSpeed_Format_Mode1           ((uint32_t)0x00000100)
#define I3C_MaxDataSpeed_Format_Mode2           ((uint32_t)0x00000200)
#define I3C_MaxDataSpeed_Format_Mode3           ((uint32_t)0x00000300)

/* I3C_HandOffActivityState */
#define I3C_HandOffActivityState_0              ((uint32_t)0x00000000)
#define I3C_HandOffActivityState_1              ((uint32_t)0x00000001)
#define I3C_HandOffActivityState_2              ((uint32_t)0x00000002)
#define I3C_HandOffActivityState_3              ((uint32_t)0x00000003)

/* I3C_DeviceIndex */
#define I3C_DeviceIndex_1                       ((uint32_t)0x00000001)
#define I3C_DeviceIndex_2                       ((uint32_t)0x00000002)
#define I3C_DeviceIndex_3                       ((uint32_t)0x00000003)
#define I3C_DeviceIndex_4                       ((uint32_t)0x00000004)

/* I3C_Direction */
#define I3C_Direction_RD                        ((uint32_t)0x00000000)
#define I3C_Direction_WR                        ((uint32_t)0x00010000)
/* I3C_EndMode */
#define I3C_EndMode_0                           ((uint32_t)0x00000000)
#define I3C_EndMode_1                           ((uint32_t)0x80000000)

/* I3C_CONTROLLER MessageType */
#define I3C_CONTROLLER_MessageType0             ((uint32_t)0x00000000)
#define I3C_CONTROLLER_MessageType1             ((uint32_t)0x08000000)
#define I3C_CONTROLLER_MessageType2             ((uint32_t)0x10000000)
#define I3C_CONTROLLER_MessageType3             ((uint32_t)0x18000000)
#define I3C_CONTROLLER_MessageType4             ((uint32_t)0x20000000)

/* I3C_TARGET_MessageType */
#define I3C_TARGET_MessageType0                 ((uint32_t)0x40000000)
#define I3C_TARGET_MessageType1                 ((uint32_t)0x48000000)
#define I3C_TARGET_MessageType2                 ((uint32_t)0x50000000)

/* I3C_PeripheralMode */
#define PeripheralMode_CONTROLLER               ((uint32_t)0x00000000)
#define PeripheralMode_TARGET                   ((uint32_t)0x00000002)

/* I3C_flags_definition */
#define I3C_FLAG_CFEF                           ((uint32_t)0x00000001)      
#define I3C_FLAG_TXFEF                          ((uint32_t)0x00000002)    
#define I3C_FLAG_CFNFF                          ((uint32_t)0x00000004)     
#define I3C_FLAG_SFNEF                          ((uint32_t)0x00000008)    
#define I3C_FLAG_TXFNFF                         ((uint32_t)0x00000010)    
#define I3C_FLAG_RXFNEF                         ((uint32_t)0x00000020)    
#define I3C_FLAG_TXLASTF                        ((uint32_t)0x00000040)  
#define I3C_FLAG_RXLASTF                        ((uint32_t)0x00000080)   
#define I3C_FLAG_FCF                            ((uint32_t)0x00000200)       
#define I3C_FLAG_RXTGTENDF                      ((uint32_t)0x00000400) 
#define I3C_FLAG_ERRF                           ((uint32_t)0x00000800)      
#define I3C_FLAG_IBIF                           ((uint32_t)0x00008000)      
#define I3C_FLAG_IBIENDF                        ((uint32_t)0x00010000)  
#define I3C_FLAG_CRF                            ((uint32_t)0x00020000)       
#define I3C_FLAG_CRUPDF                         ((uint32_t)0x00040000)   
#define I3C_FLAG_HJF                            ((uint32_t)0x00080000)       
#define I3C_FLAG_WKPF                           ((uint32_t)0x00200000)     
#define I3C_FLAG_GETF                           ((uint32_t)0x00400000)    
#define I3C_FLAG_STAF                           ((uint32_t)0x00800000)      
#define I3C_FLAG_DAUPDF                         ((uint32_t)0x01000000)    
#define I3C_FLAG_MWLUPDF                        ((uint32_t)0x02000000)   
#define I3C_FLAG_MRLUPDF                        ((uint32_t)0x04000000)  
#define I3C_FLAG_RSTF                           ((uint32_t)0x08000000)     
#define I3C_FLAG_ASUPDF                         ((uint32_t)0x10000000)    
#define I3C_FLAG_INTUPDF                        ((uint32_t)0x20000000)  
#define I3C_FLAG_DEFF                           ((uint32_t)0x40000000)      
#define I3C_FLAG_GRPF                           ((uint32_t)0x80000000)      

/* I3C_interrupts_definition */
#define I3C_IT_CFNFIE                           ((uint32_t)0x00000004)     
#define I3C_IT_SFNEIE                           ((uint32_t)0x00000008)     
#define I3C_IT_TXFNEIE                          ((uint32_t)0x00000010)
#define I3C_IT_RXFNEIE                          ((uint32_t)0x00000020)
#define I3C_IT_FCIE                             ((uint32_t)0x00000200)
#define I3C_IT_RXTGTENDIE                       ((uint32_t)0x00000400) 
#define I3C_IT_ERRIE                            ((uint32_t)0x00000800)
#define I3C_IT_IBIIE                            ((uint32_t)0x00008000)      
#define I3C_IT_IBIENDIE                         ((uint32_t)0x00010000) 
#define I3C_IT_CRIE                             ((uint32_t)0x00020000)       
#define I3C_IT_HJIE                             ((uint32_t)0x00080000)       
#define I3C_IT_CRUPDIE                          ((uint32_t)0x00040000)  
#define I3C_IT_WKPIE                            ((uint32_t)0x00200000)    
#define I3C_IT_GETIE                            ((uint32_t)0x00400000)   
#define I3C_IT_STAIE                            ((uint32_t)0x00800000)    
#define I3C_IT_DAUPDIE                          ((uint32_t)0x01000000)  
#define I3C_IT_MWLUPDIE                         ((uint32_t)0x02000000) 
#define I3C_IT_MRLUPDIE                         ((uint32_t)0x04000000) 
#define I3C_IT_RSTIE                            ((uint32_t)0x08000000)    
#define I3C_IT_ASUPDIE                          ((uint32_t)0x10000000)  
#define I3C_IT_INTUPDIE                         ((uint32_t)0x20000000) 
#define I3C_IT_DEFIE                            ((uint32_t)0x40000000)
#define I3C_IT_GRPIE                            ((uint32_t)0x80000000)

/* I3C_ERROR */
#define I3C_ERROR_CE0                           ((uint32_t)0x00000000)
#define I3C_ERROR_CE1                           ((uint32_t)0x00000001)          
#define I3C_ERROR_CE2                           ((uint32_t)0x00000002)  
#define I3C_ERROR_CE3                           ((uint32_t)0x00000003)  
#define I3C_ERROR_TE0                           ((uint32_t)0x00000008)   
#define I3C_ERROR_TE1                           ((uint32_t)0x00000009) 
#define I3C_ERROR_TE2                           ((uint32_t)0x0000000A)  
#define I3C_ERROR_TE3                           ((uint32_t)0x0000000B)  
#define I3C_ERROR_TE4                           ((uint32_t)0x0000000C)  
#define I3C_ERROR_TE5                           ((uint32_t)0x0000000D)  
#define I3C_ERROR_TE6                           ((uint32_t)0x0000000E)                                                                         
#define I3C_ERROR_PERR                          ((uint32_t)0x00000010) 
#define I3C_ERROR_STALL                         ((uint32_t)0x00000020)
#define I3C_ERROR_DOVR                          ((uint32_t)0x00000040)
#define I3C_ERROR_COVR                          ((uint32_t)0x00000080)
#define I3C_ERROR_ADDRESS_NACK                  ((uint32_t)0x00000100)
#define I3C_ERROR_DATA_NACK                     ((uint32_t)0x00000200)
#define I3C_ERROR_DATA_HAND_OFF                 ((uint32_t)0x00000400) 


void I3C_DeInit(void);
void I3C_Ctrl_Init(I3C_Ctrl_BusTypeDef *I3C_InitStruct);
void I3C_Tgt_Init(uint8_t BusAvailableDuration);
void I3C_Ctrl_Config(I3C_CtrlConfTypeDef *pConfig);
void I3C_Tgt_Config(I3C_TgtConfTypeDef *pConfig);
void I3C_Cmd(FunctionalState NewState);
void I3C_ArbitrationHeaderCmd(FunctionalState NewState);
void I3C_HJAckCmd(FunctionalState NewState);
void I3C_DMAReq_RXCmd(FunctionalState NewState);
void I3C_DMAReq_TXCmd(FunctionalState NewState);
void I3C_DMAReq_StatusCmd(FunctionalState NewState);
void I3C_DMAReq_ControlCmd(FunctionalState NewState);
void I3C_ExitPatternCmd(FunctionalState NewState);
void I3C_RequestTransfer(void);
void I3C_TxPreloadConfig(uint16_t TxDataCount);
void I3C_TARGET_ResetCmd(FunctionalState NewState);
void I3C_CONTROLLER_ResetCmd(FunctionalState NewState);
void I3C_SetModeConfig(uint32_t PeripheralMode);
void I3C_Ctrl_ConfigBusDevices(I3C_DeviceConfTypeDef *pDesc);
void I3C_Ctrl_SetConfigResetPattern(FunctionalState resetPattern);
FunctionalState I3C_Ctrl_GetConfigResetPattern(void);
void I3C_FlushAllFifo(void);
void I3C_FlushControlFifo(void);
void I3C_FlushStatusFifo(void);
void I3C_SetConfigFifo(I3C_FifoConfTypeDef *pConfig);
void I3C_ClearConfigFifo(void);
uint8_t I3C_ReadByte(void);
uint32_t I3C_ReadWord(void);
void I3C_WriteByte(uint8_t Byte);
void I3C_WriteWord(uint32_t Word);
void I3C_IBIDataConfig(uint32_t Data);
void  I3C_GetCCCInfo(I3C_Notify_ID_TypeDef notifyId, I3C_CCCInfoTypeDef *pCCCInfo);
void I3C_ControllerHandleMessage(uint32_t TargetAddr, uint32_t TransferSize, uint32_t Direction, uint32_t MessageType, uint32_t EndMode);
void I3C_ControllerHandleCCC(uint32_t CCCValue, uint32_t AddByteSize, uint32_t EndMode);
void I3C_TargetHandleMessage(uint32_t MessageType, uint32_t IBISize);
uint8_t I3C_GetMessageDirection(void);
uint8_t I3C_GetTargetAbortPrivateRead(void);
uint16_t I3C_GetGetXferDataCount(void);
uint8_t I3C_GetMessageIdentifier(void);
uint8_t I3C_GetGetIBITargetAddr(void);
uint8_t I3C_GetReceiveCommandCode(void);
uint8_t I3C_GetGetNbIBIAddData(void);
uint8_t I3C_GetGetResetAction(void);
FunctionalState I3C_GetAllowedPayloadUpdate(uint32_t DeviceIndex);
uint8_t I3C_GetMIPIInstanceID(void);
uint8_t I3C_GetIDTypeSelector(void);
uint16_t I3C_GetMIPIManufacturerID(void);
void I3C_ITConfig(uint32_t I3C_IT, FunctionalState NewState);
ITStatus I3C_GetITStatus(uint32_t I3C_IT);
void I3C_ClearITPendingBit(uint32_t I3C_IT);
FlagStatus I3C_GetFlagStatus(uint32_t I3C_FLAG);
FlagStatus I3C_GetErrorStatus(uint32_t I3C_Error);
void I3C_ClearFlag(uint32_t I3C_FLAG);


#ifdef __cplusplus
}
#endif

#endif
